---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomSpaceTypeParam
source: html/2752c53d-35b0-937d-36bf-19e69d862feb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomSpaceTypeParam Property

"Space Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomSpaceTypeParam { get; }
```